# Loading Data in Pandas

In real projects, data comes from files.

Common formats:<br>
• CSV (most common)<br>
• JSON

In [5]:
import pandas as pd

## Loading CSV File

In [6]:
sales = pd.read_csv("../data/raw/sales.csv")
sales.head()

,order_id,customer_id,product,category,price,quantity,city,date
0,1001,C101,Laptop,Electronics,55000,1,Delhi,2024-01-05
1,1002,C102,Phone,Electronics,20000,2,Mumbai,2024-01-06
2,1003,C103,Shoes,Fashion,3000,1,Pune,2024-01-07
3,1004,C101,Headphones,Electronics,2000,3,Delhi,2024-01-07
4,1005,C104,Tshirt,Fashion,800,2,Bangalore,2024-01-08

## Loading Another CSV

In [7]:
customers = pd.read_csv("../data/raw/customers.csv")
customers.head()

  customer_id           name  age  gender       city
0        C101  Lakshay Bamel   23    Male      Delhi
1        C102    Amit Sharma   25    Male     Mumbai
2        C103     Neha Verma   22  Female       Pune
3        C104     Riya Singh   24  Female  Bangalore
4        C105    Rahul Mehta   28    Male    Chennai

## Loading Large Dataset (Air Quality)

In [8]:
air = pd.read_csv("../data/raw/air_quality.csv")
air.head()

,timestamp,country,city,latitude,longitude,pm25,pm10,no2,so2,o3,co,aqi,temperature,humidity,wind_speed
0,2025-11-04 18:25:17.554219,US,New York,40.713,-74.006,50.295,108.938,27.998,6.539,52.568,1.096,108,18.504,70.168,3.725
1,2025-11-04 19:25:17.554219,US,New York,40.713,-74.006,32.083,63.043,36.120,4.021,43.536,1.075,90,5.838,80.088,8.969
2,2025-11-04 20:25:17.554219,US,New York,40.713,-74.006,42.250,82.553,26.935,9.538,23.320,0.977,84,31.833,62.783,9.650
3,2025-11-04 21:25:17.554219,US,New York,40.713,-74.006,30.403,79.951,63.536,7.609,31.369,0.230,158,23.140,89.153,8.956
4,2025-11-04 22:25:17.554219,US,New York,40.713,-74.006,21.083,66.423,38.997,6.919,45.615,1.085,97,13.632,76.499,4.017

## Loading JSON File

In [9]:
json_data = pd.read_json("../data/raw/sample.json")
json_data

      name  rating                feedback   age
0    Alice       5           Great product  25.0
1      Bob       4  Good but late delivery  30.0
2  Charlie       2          Bad experience   NaN
3    Diana       5                Loved it  28.0
4      Eve       3                 Average  20.0

## Inspect Data Shapes

In [10]:
sales.shape, customers.shape, air.shape, json_data.shape

((10, 8), (6, 5), (18000, 15), (5, 4))

## Conclusion

Pandas can load structured data from multiple formats.